Revit 2024 API
TextNoteOptions.Rotation Property
 Base line angle of a text note, in radians.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2016
Syntax
C#
public double Rotation { get; set; }
Visual Basic
Public Property Rotation As Double
	Get
	Set
Visual C++
public:
property double Rotation {
	double get ();
	void set (double value);
}
Remarks
 Default value is 0.0.
See Also
TextNoteOptions Class
Autodesk.Revit.DB Namespace